## Data Cleaning assignment

### Problem statement

In [1]:
#Import the libraries
import pandas as pd
import numpy as np

In [2]:
#Load the data
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
#Read the data
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### Question NO-1

Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
df.iloc[1,1]=10055
df.iloc[3,1]=10075

In [5]:
#After imputing the missing values in the flight column
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
#First check data type
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [7]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [8]:
#After changing the dtype of the column
df['FlightNumber'].dtypes

dtype('int32')

### Question-2

The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [9]:
#Separate the 'From_To' columns in to 'To','From'
df['To']=df['From_To'].apply(lambda x:x.split('_')[1])
df['From']=df['From_To'].apply(lambda x:x.split('_')[0])

In [10]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),paris,LoNDon
1,MAdrid_miLAN,10055,[],<Air France> (12),miLAN,MAdrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),StockhOlm,londON
3,Budapest_PaRis,10075,[13],12. Air France,PaRis,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",londOn,Brussels

### Question No 3
Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [11]:
df['From']=df['From'].apply(lambda x: x.lower() and x.capitalize())
df['To']=df['To'].apply(lambda x: x.lower() and x.capitalize())

In [12]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London
1,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London
3,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",London,Brussels

### Question No 4
Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [13]:
df=df.drop(labels=['From_To'],axis=1)

In [14]:
df.head()

   FlightNumber  RecentDelays              Airline         To      From
0         10045      [23, 47]               KLM(!)      Paris    London
1         10055            []    <Air France> (12)      Milan    Madrid
2         10065  [24, 43, 87]  (British Airways. )  Stockholm    London
3         10075          [13]       12. Air France      Paris  Budapest
4         10085      [67, 32]          "Swiss Air"     London  Brussels

### Question No 5
In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [28]:
recent=pd.DataFrame(df['RecentDelays'].values.tolist(),columns=['Delay_1','Delay_2','Delay_3'])
recent

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [29]:
df=pd.concat([df,recent],axis=1)

In [31]:
df=df.drop('RecentDelays',1)
df.head()

,FlightNumber,Airline,To,From,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),Paris,London,23.0,47.0,NaN
1,10055,<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"""Swiss Air""",London,Brussels,67.0,32.0,NaN